src/Конфигурация/DataProcessors/ОстаткиДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>ОстаткиДС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Конфигурация/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Конфигурация/DataProcessors/ОстаткиДС/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьОстаткиДС()
	ОстаткиДС.Очистить();
	ТЗ    = РегистрыНакопления.ДенежныеСредства.Остатки();
	ТЗ.Сортировать("Кошелек");
	Колонка = ТЗ.Колонки.Добавить("Валюта");
	Итого = 0;
	Для Каждого СтрокаТЧ Из ТЗ Цикл
		НоваяСтрока = ОстаткиДС.Добавить();
		СтрокаТЧ.Валюта = СтрокаТЧ.Кошелек.Валюта;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
	КонецЦикла;	
	
	ТЗ.Свернуть("Валюта","Сумма");
	ТЗ.Сортировать("Валюта");
	Итого = "";
	Для Каждого СтрокаТЧ Из ТЗ Цикл
		Если СтрокаТЧ.Сумма <> 0 Тогда
			Итого = Итого + ?(ПустаяСтрока(Итого),"","; ") + Формат(СтрокаТЧ.Сумма,"ЧДЦ=; ЧГ=") + " " + ?(ЗначениеЗаполнено(СтрокаТЧ.Валюта),СтрокаТЧ.Валюта,"<>");
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаОбновитьОстаткиДС(Команда)
	ОбновитьОстаткиДС();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОстаткиДС();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ОткрытьФорму("Обработка.ЖурналТранзакций.Форма.Форма",Новый Структура("Кошелек",ТекСтрока.Кошелек));
	КонецЕсли;	
КонецПроцедуры
